Revit 2027 API
View.CanModifyViewDiscipline Method
 Indicates if the View Discipline can be modified
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanModifyViewDiscipline()
Public Function CanModifyViewDiscipline As Boolean
public:
bool CanModifyViewDiscipline()
member CanModifyViewDiscipline : unit -> bool
Return Value
Boolean
 True if View Discipline can be modified
See Also
Reference
View Class
Autodesk.Revit.DB Namespace